@echo off
mode con cols=120 lines=35
color 07

::判断是否为空
set str=
set /p str=<./B_设置_同步备份路径.txt
if defined str (

goto notkong

) else goto kong

::---------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------

:notkong

::备份路径
set /p 备份路径=<./B_设置_同步备份路径.txt


::上级文件夹名字
for %%a in ("%~dp0\..\..") do set 上级目录=%%~nxa
echo %上级目录%

::去掉空格
set str=%time:~0,2%
set str=%str: =%
echo %str%

::设置时间
set timest=%date:~0,4%_%date:~5,2%%date:~8,2%_%str%-%time:~3,2%-%time:~6,2%


::开始备份
robocopy %cd%\..\.. %备份路径%\%上级目录%\backup_%timest%\%上级目录% /mir /MT:64 /TEE /LOG:备份日志.txt

::把备份日志，移动到同步文件夹
move 备份日志.txt %备份路径%\%上级目录%\backup_%timest%\%上级目录%\备份日志.txt


::打开备份文件夹
start "" "%备份路径%\%上级目录%\backup_%timest%\%上级目录%"

exit

::---------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------

:kong
echo 请设置一个路径
start "" "B_设置_同步备份路径.txt"


