@echo off
mode con cols=120 lines=35
color 07

::判断是否为空
set str=
set /p str=<./B_设置_同步备份路径.txt
if defined str (

goto startSy

) else goto kong

::---------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------

:startSy

::设置同步路径
set /p 同步路径=<./B_设置_同步备份路径.txt

::上级文件夹名字
for %%a in ("%~dp0\..\..") do set 上级目录=%%~nxa
echo %上级目录%


::开始同步
robocopy %cd%\..\.. %同步路径%\%上级目录%\Sync\%上级目录% /mir /MT:64 /TEE /LOG:同步日志.txt

::把同步日志，移动到同步文件夹
move 同步日志.txt %同步路径%\%上级目录%\Sync\%上级目录%\同步日志.txt

timeout /t 60 /nobreak > nul

goto startSy


::---------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------

:kong
echo 请设置一个路径
start "" notepad 设置_同步备份路径.txt
pause

